import time
import matplotlib.pyplot as plt
import random


# x: 밑수를 의미하는 리스트 한개만 있으면 됨

x = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
y1 = [
    3.379617, 3.005680, 2.863100, 2.903693, 2.984774, 3.158070, 3.395558, 3.639906, 3.811959, 4.005996, 4.228564, 4.368210, 4.540784, 4.654461, 4.661991, 4.670715, 4.692815, 4.706277, 4.676055, 4.680741
]

y2 = [3.572227, 3.210291, 3.067102, 3.126144, 3.255195, 3.430258, 3.600303, 3.817460, 3.978501, 4.143634, 4.305317, 4.475262, 4.627627, 4.731972, 4.807221, 4.800143, 4.766556, 4.770685, 4.788492, 4.793030
      ]

y3 = [
    3.797982, 3.367312, 3.227951, 3.232265, 3.315596, 3.496603, 3.740610, 3.905522, 4.067783, 4.282122, 4.417197, 4.606118, 4.733289, 4.843801, 4.809741, 4.813502, 4.840626, 4.842201, 4.860876, 4.844404
]

# y1: w =8
# y2: w = 32
# y3: w = 64


u = 1

plt.title("Karastuba Multiplication")


# plot()메서드를 통해 x축에는 x(=date)값, y축에는 y1(= 6월 서울의 'AveTemp' 데이터) 선 색깔은 하늘색'skyblue'로 설정 그리고 범례는 Seoul로 설정.
plt.plot(x, y1, 'skyblue', label="w = 8")
plt.plot(x, y2, 'orange', label="w = 32")
plt.plot(x, y3, 'red', label="w = 64")
# plt.plot(x,y4,'green', label="Naive")


plt.legend()
# x축 글자의 가독성을 위해 글자를 70도 가량 회전시킴.
plt.xticks(rotation=70)
plt.xlabel("flag")
# y축의 이름을 "Temperature"로 설정.
plt.ylabel("time (s)")
plt.show()
